Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/employment/employment_rights_and_conditions/pay_and_employment/index.html.txt.tmx
Source language: en
Languages: ga

source: All employees are entitled by law to a written statement of salary
ga: Bíonn gach fostaí i dteideal faoin dlí ráiteas scríofa tuarastail a fháil

source: This statement is called a 'pay slip'
ga: 'Pádhuille' a thugtar ar an ráiteas sin

source: Find out about your rights here
ga: Faigh amach faoi do chearta anseo

source: Under the National Minimum Wage Act 2000 most employees are entitled to a minimum wage
ga: Faoin Acht um Pá Íosta Náisiúnta 2000 tá an chuid is mó d'fhostaithe i dteideal íosráta pá

source: Your P45 and P60 certificates
ga: Do theastais P45 agus P60

source: Your employer is responsible for paying your PRSI contributions and must give you a P60 or a P45 when you leave
ga: Tá d'fhostóir freagrach as do chuid ranníocaíochtaí ÁSPC a íoc agus caithfidh sé/sí P60 nó P45 a thabhairt duit nuair atá tú ag fágáil?

source: When you are regularly paid late
ga: Nuair a íoctar déanach thú go rialta

source: If your employer is regularly late when paying your wages then there are procedures you can use to enforce your legal right to your pay
ga: Má tá d’fhostóir á d’íoc déanach go rialta tá nósanna imeachta gur féidir leat a úsáid chun do cheart dlíthiúil a fheidhmiú agus do phá a fháil

source: Leaving work without being paid
ga: Ag fágáil oibre gan a bheith íoctha

source: Find out how to make a compaint about non-payment of wages
ga: Ag fágáil oibre gan a bheith íoctha

source: Taxation of benefits from employment
ga: Cáin ar shochair ón bhfostaíocht

source: Employees can get certain benefits in addition to their salary or wages. Some of these benefits are taxed. This document provides information on how such benefits are taxed
ga: Tá cur síos sa cháipéis seo ar na príomhshochair gur féidir le fostaí a fháil sa bhreis ar a t(h)uarastal/pá agus conas a ngearrtar cáin ar na sochair sin

source: This document is in: Money and Tax > Tax > Income tax
ga: This document is in: Airgead agus Cáin > Cáin > Cáin ioncaim

source: How your income tax is calculated
ga: An córas le cáin a mheas

source: Tax on income you earn from employment is deducted directly from your salary (pay)
ga: Cur síos ar an gcóras nua creidhmheasanna cánacha

source: Employee share option schemes
ga: Scéimeanna Scaireanna Fostaithe in Éirinn

source: Employees in Ireland can avail of certain share optionsfrom their company that may be "tax free" or "tax efficient"
ga: In Éirinn, is féidir le fostaithe roghanna faoi leith scaireanna a ghlacadh óna gcomhlacht a d'fhéadfadh a bheith saor ó cháin nó cáin éifeachtúil

source: Find out about the two main ways an employee can benefit from shares in the company
ga: Faigh amach faoin dá phríomhbhealach gur féidir le fostaí leas a bhaint as scaireanna ó chomhlacht

source: This document is in: Money and Tax > Tax > Tax on savings and investments
ga: This document is in: Airgead agus Cáin > Cáin > Cáin ar choigiltis agus infheistíochtaí

source: Help with low pay
ga: Cúnamh do dhaoine ar phá iseal

source: Tax and social welfare assistance is available for low income earners and their families
ga: Tá faoiseamh cánach agus cúnamh leasa shóisialaigh le fáil in Éirinn ag daoine ar ioncam íseal agus ag a gclann

source: Information on available schemes and how to apply
ga: Eolas faoi na scéimeanna féin agus faoin gcaoi le cur isteach orthu

source: This document is in: Social Welfare > Social welfare payments > Social welfare payments and work
ga: This document is in: Leas Sóisialach > Íocaíochtaí Leasa Shóisialaigh > Íocaíochtaí Leasa Shóisialaigh agus Obair

source: Most Read in "Employment"
ga: Ábhar is mó éilimh i "Fostaíocht"

source: Rest periods and breaks
ga: Tréimhsí sosa agus sosanna

source: Tax and starting work - PAYE
ga: Gnó a chur ar bun
